# IsTaggedOnSubelement Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
IndependentTag..::..IsTaggedOnSubelement Method
IndependentTag Class See Also
---
Returns true if the tag is tagged on a subelement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool IsTaggedOnSubelement()
```

Visual Basic
---
```text
Public Function IsTaggedOnSubelement As Boolean
```

Visual C++
---
```text
public:
bool IsTaggedOnSubelement()
```

# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace